Revit 2026 API

# StoneStoneBumpMap Property

---

The property labeled "Image" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StoneBumpMap { get; }
```
```vb
Public Shared ReadOnly Property StoneBumpMap As String
	Get
```
```cpp
public:
static property String^ StoneBumpMap {
	String^ get ();
}
```
```fsharp
static member StoneBumpMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace